---
kind: enumMember
id: F:Autodesk.Revit.DB.RenderDuration.ByTime
enum: Autodesk.Revit.DB.RenderDuration
source: html/26445fcb-caf7-8cfd-6b5b-74f71e0db936.htm
---
# Autodesk.Revit.DB.RenderDuration.ByTime

Render by the defined time.